Repository: common-repository/market-exporter
Catalog: languages/market-exporter-*.po
Languages: ru_ru

source: Error generating file
ru_ru: Ошибка при создании файла

source: Currently only the following currency is supported: Russian Ruble (RUB), Ukrainian Hryvnia(UAH), Tenge (KZT), US Dollar (USD) and Euro (EUR).
ru_ru: Поддерживаются следующие валюты: Российский рубль (RUB), Украинская гривна (UAH), Тенге (KZT), Доллар США (USD) и Евро (EUR). Пожалуйста, <a href=\"%s\">обновите валюту</a>.

source: No shipping methods are available.
ru_ru: Не указаны способы доставки.

source: Unable to find any products in WooCommerce.
ru_ru: Не найдено ни одного товара в WooCommerce.

source: Settings
ru_ru: Настройки

source: This plugin is used to generate a valid YML file for exporting your products in WooCommerce to Yandex Market.
ru_ru: Данный плагин используется для генерации валидного YML файла для экспортированная товаров из WooCommerce в Яндекс Маркет.

source: Please be patient while the YML file is generated. This can take a while if your server is slow or if you have many products in WooCommerce. Do not navigate away from this page until this script is done or the YML file will not be created. You will be notified via this page when the process is completed.
ru_ru: Пожалуйста, будьте терпеливы в то время как файл YML генерируется. Это может занять некоторое время если ваш сервер медленно работает (например, если используется недорогой хостинг) или если у Вас много товарных предложений в WooCommerce. Не уходите с этой страницы, пока этот процесс не будет завершен, или файл YML не будет создан. Вы будете уведомлены при завершении.

source: Version: %s
ru_ru: Версия: %s

source: The Market Exporter plugin requires %1$sWooCommerce%2$s to be installed and activated. Please check your configuration.
ru_ru: Плагину Market Exporter необходим активированный %1$sWooCommerce%2$. Пожалуйста, установите или активируйте плагин WooCommerce.

source: Do you like the plugin? Please support the development by %1$swriting a review%2$s!
ru_ru: Поддержите разработку плагина, %1$sоставив отзыв%2$s!

source: The short name of the store, no more than 20 characters. The name may not contain words not related to the store's name (such as “best” or “cheap”), and may not include a phone number and so on. The name of the store must match the actual name of the store that is published on the website. If this requirement is not met, Yandex Market can change the name itself without notifying the store.
ru_ru: Короткое название магазина, не более 20 символов. В названии нельзя использовать слова, не имеющие отношения к наименованию магазина, например «лучший», «дешевый», указывать номер телефона и т. п. Название магазина должно совпадать с фактическим названием магазина, которое публикуется на сайте. При несоблюдении этого требования наименование Яндекс.Маркет может самостоятельно изменить название без уведомления магазина.

source: Full name of the company that owns the store. It is used for internal identification and not published.
ru_ru: Полное наименование компании, владеющей магазином. Не публикуется, используется для внутренней идентификации.

source: URL of store's home page. No more than 50 characters. Cyrillic links are permitted.
ru_ru: URL главной страницы магазина. Максимум 50 символов. Допускаются кириллические ссылки. Элемент обязателен при размещении по модели «Переход на сайт».

source: Content management system (CMS) used for the store.
ru_ru: Система управления контентом, на основе которой работает магазин (CMS).

source: CMS version.
ru_ru: Версия CMS.

source: Name of the agency that provides technical support to the store and is responsible for the website's functionality.
ru_ru: Наименование агентства, которое оказывает техническую поддержку магазину и отвечает за работоспособность сайта.

source: Contact email address of the CMS developers or agency that provides tech support.
ru_ru: Контактный адрес разработчиков CMS или агентства, осуществляющего техподдержку.

source: Product model.
ru_ru: Модель товара.

source: Manufacturer name.
ru_ru: Название производителя.

source: Product type or category.
ru_ru: Тип / категория товара (например, «мобильный телефон», «стиральная машина», «угловой диван»).

source: Vendor code.
ru_ru: Код производителя для данного товара.

source: If enabled products that are available for backorder will be exported to YML.
ru_ru: Если активна, то товары, доступные для предзаказа, будут экспортированы в YML.

source: Only selected categories will be included in the export file. Hold down the control (ctrl) button on Windows or command (cmd) on Mac to select multiple options. If nothing is selected - all the categories will be exported.
ru_ru: Только выбранные категории товаров будут экспортированы в файл. Чтобы выбрать несколько категорий, зажмите клавишу ctrl (на Windows) или cmd (на Mac). Если не выбрана ни одна категория, то экспортируются все товары.

source: Sales notes attribute allows passing in additional conditions for sales. Not longer than 50 characters.
ru_ru: Элемент sales_notes позволяет передать условия продажи товара. Не более 50 символов.

source: Define if manufacturer warranty is available for selected product. Available values: true of false.
ru_ru: Элемент предназначен для отметки товаров, имеющих официальную гарантию производителя. Возможные значения: true, false.

source: Define country of origin for a product. See http://partner.market.yandex.ru/pages/help/Countries.pdf for a list of available values.
ru_ru: Элемент предназначен для указания страны производства товара. Список стран, которые могут быть указаны в этом элементе: http://partner.market.yandex.ru/pages/help/Countries.pdf.

source: If enabled weight and size data from WooCommerce will be exported to Weight and Dimensions elements.
ru_ru: Если активна, то данные о весе и размерах товара будут экспортированы в элементы weight и dimensions (вес должен быть указан в кг., размеры в см.)

source: Selected attributes will be exported as a parameters. Hold down the control (ctrl) button on Windows or command (cmd) on Mac to select multiple options.
ru_ru: Выбранные атрибуты будут экспортированы в качестве параметров (элемент param).

source: Images per product. Not more than 10 images.
ru_ru: Изображений на товарное предложение. Не более 10 изображений.

source: Adds the number of available products in stock.
ru_ru: При учете запасов, добавлять количество в параметр stock_quantity.

source: The product is of a sexual nature or pertains to sexual interest in any way.
ru_ru: Товар имеет отношение к удовлетворению сексуальных потребностей, либо иным образом эксплуатирует интерес к сексу.

source: This element is used in descriptions for all offers that are variants of a particular model (parent offer ID is used).
ru_ru: Элемент объединяет все предложения, которые являются вариациями одной модели и должен иметь одинаковое значение (используется ID товара-родителя).

source: VAT rate. VAT_18 (18%) is the primary rate used for most products. VAT_10 (10%) can be used for children's goods or foodstuff. VAT_0 (0%) is used only for certain types of services. NO_VAT can be used for medical products or software licenses.
ru_ru: Налоговая ставка. Ставка VAT_18 (18%) используется для большинства товаров? VAT_10 (10%) можно использовать для детских товаров или продуктов. VAT_0 (0%) используется для продажи сервисов. Опция NO_VAT может быть использована при продаже медицинских товаров или программных лицензий.

source: Disabled
ru_ru: Выключено

source: Use the delivery element to indicate the possibility of delivery to the buyer's address in the home region of the store.
ru_ru: Используйте элемент delivery, чтобы указать возможность доставки по адресу покупателя в домашнем регионе магазина.

source: Use the pickup element to indicate the possibility of receiving goods at the issuance point.
ru_ru: Используйте элемент pickup, чтобы указать возможность получения товара в пункте выдачи.

source: Use the store element to indicate the possibility of buying without a preliminary order at the point of sale.
ru_ru: Используйте элемент store, чтобы указать возможность покупки без предварительного заказа в точке продажи.

source: Use delivery-options parameters defined below. Global options.
ru_ru: Если включено, то в качестве параметров delivery-options будут использованы значения из настроек ниже. Глобальная опция.

source: Delivery-options cost element. Used to indicate the price of delivery. Use maximum value if cost is differs for different locations.
ru_ru: Элемент cost для delivery-options. В качестве значения используйте только целые числа. Для бесплатной доставки укажите значение 0.

source: 0, 1, 2, 3-5, etc.
ru_ru: 0, 1, 2, 3-5, и т.д.

source: Delivery-options days element. Either a value or a range for the actual days it takes to deliver a product.
ru_ru: Элемент days для delivery-options. Либо целое число для дней доставки, либо период «от — до».

source: Delivery-options order-before element. Accepts values from 0 to 24. If the order is made before this time, delivery will be on time.
ru_ru: Элемент order-before для delivery-options. Местное время (в часовом поясе магазина), при заказе до которого действует срок доставки.

source: Add date to YML file name. If enabled YML file will have current date at the end: ym-export-yyyy-mm-dd.yml.
ru_ru: Добавить дату в имя файла. Если активна, то к имена файла YML будет добавляться текущая дата: yml-export-yyyy-mm-dd.yml.

source: Auto generate file at the selected interval.
ru_ru: Обновлять файл в выбранный промежуток.

source: Every hour
ru_ru: Каждый час

source: Twice a day
ru_ru: Два раза в сутки

source: Daily
ru_ru: Каждый день

source: Product description. Specify the way the description is exported. Default is to try and get the product description, if empty - get short description.
ru_ru: Описание товара. Опция для выгрузки элемента description. По умолчанию, будет выгружаться описание товара, если оно пустое, то будет использовано краткое описание.

source: Default
ru_ru: По умолчанию

source: Only description
ru_ru: Только описание

source: Only short description
ru_ru: Только краткое описание

source: Regenerate file on product create/update
ru_ru: Обновлять файл при внесении изменений или создании нового товара

source: Split up product attributes into separate param elements
ru_ru: Объединять (через запятую) несколько значений атрибута в единый элемент param.

source: Use `count` or `stock_quantity` for stock parameter. The `stock_quantity` option needs to be added to the offer section above
ru_ru: Использовать параметр `count` или `stock_quantity` для выгрузки стока. Опция `stock_quantity` должна быть добавлена в раздел Offer выше

source: Use `oldprice` or `old_price` for original (pre-sale) price.
ru_ru: Использовать параметр `oldprice` или `old_price` для цены до скидки.

source: Hey %1$s
ru_ru: Привет, %1$s

source: Please help us improve %2$s! If you opt-in, some data about your usage of %2$s will be sent to %5$s. If you skip this, that's okay! %2$s will still work just fine.
ru_ru: Помогите нам улучшить %2$s! Если Вы согласитесь, данные об использовании %2$s будут предоставлены %5$s для анализа. Это позволит нам сделать плагин еще лучше. Если Вы откажитесь, ничего страшного - это никак не повлияет на работу плагина.

source: Error uploading file.
ru_ru: Невозможно сохранить файл.

source: Error creating directory.
ru_ru: Невозможно создать директорию.

source: Either action or items are not defined
ru_ru: Не задано действие или отсутствует товарное предложение

source: Unable to update the settings
ru_ru: Ошибка при обновлении настроек

source: Method %s not found.
ru_ru: Метод %s не найден.

source: Error determining steps or progress during generation
ru_ru: Ошибка при обработке (неверное количество шагов или сбой в процессе)

source: No files selected
ru_ru: Не выбрано ни одного файла

source: Error removing files
ru_ru: Ошибка при удалении файла

source: Market Exporter integration suite.
ru_ru: Модуль интеграции Market Exporter.

source: Anton Vanyukov
ru_ru: Антон Ванюков

source: Generate YML
ru_ru: Создать YML

source: Add new setting
ru_ru: Добавить параметр

source: Shop
ru_ru: Магазин

source: Offer
ru_ru: Товар

source: Select setting
ru_ru: Выбрать параметр

source: No available items to select
ru_ru: Нет доступных параметров

source: Add items
ru_ru: Добавить

source: Available YML files
ru_ru: Доступные YML файлы

source: Remove files
ru_ru: Удалить

source: You have not yet generated any files
ru_ru: Вы еще не создали ни одного YML файла

source: Initializing generation engine...
ru_ru: Инициализация выгрузки…

source: Finalizing...
ru_ru: Завершаем выгрузку…

source: Generating file: step %d of %d
ru_ru: Процесс генерации: шаг %d из %d

source: Generating file
ru_ru: Генерируем файл

source: Remove settings
ru_ru: Удалить

source: Delivery options
ru_ru: Доставка

source: Misc
ru_ru: Разное

source: Active
ru_ru: Включить
